---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
source: html/ff4bacf2-2b7d-aecb-e9d9-3d504111ecb5.htm
---
# RevitAPIPreDocEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.